---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Int32)
source: html/7c4037bc-b04c-a834-f670-1608d3fdf719.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

Sets the attribute value.

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	int value
)
```

## Parameters
- **name** (`System.String`) - The attribute name.
- **value** (`System.Int32`) - The value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null